УчетВУправляющихДляГит1/src/DataProcessors/ПечатьЧека/ПечатьЧека.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПечатьЧека</name>
  <attributes>
    <name>СуммаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправлятьEmail</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправлятьSMS</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПечататьЧек</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресЭлектроннойПочты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерТелефона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоррекцияПоПредписанию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеКоррекции</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаКоррекции</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПредписания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КорректируемыйДокумент</name>
    <type>
      <types>DefinedType.ОснованиеФискальнойОперацииБПО</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧекКоррекции</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТаблицаТоваров</name>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Штрихкод</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаСоСкидками</name>
      <comment>Цена со скидками</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСкидок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПризнакСпособаРасчета</name>
      <type>
        <types>EnumRef.ПризнакиСпособаРасчета</types>
      </type>
    </attributes>
    <attributes>
      <name>ПризнакПредметаРасчета</name>
      <type>
        <types>EnumRef.ПризнакиПредметаРасчета</types>
      </type>
    </attributes>
    <attributes>
      <name>ПризнакАгентаПоПредметуРасчета</name>
      <type>
        <types>EnumRef.ПризнакиАгента</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерСекции</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТаможеннойДекларации</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>32</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодСтраныПроисхожденияТовара</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>3</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

УчетВУправляющихДляГит1/src/Enums/ПризнакиАгента/ПризнакиАгента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПризнакиАгента</name>
  <enumValues>
    <name>БанковскийПлатежныйАгент</name>
    <comment>Оказание услуг покупателю (клиенту) пользователем, являющимся банковским платежным агентом</comment>
  </enumValues>
  <enumValues>
    <name>БанковскийПлатежныйСубагент</name>
    <comment>Оказание услуг покупателю (клиенту) пользователем, являющимся банковским платежным субагентом</comment>
  </enumValues>
  <enumValues>
    <name>ПлатежныйАгент</name>
    <comment>Оказание услуг покупателю (клиенту) пользователем, являющимся платежным агентом</comment>
  </enumValues>
  <enumValues>
    <name>ПлатежныйСубагент</name>
    <comment>Оказание услуг покупателю (клиенту) пользователем, являющимся платежным субагентом</comment>
  </enumValues>
  <enumValues>
    <name>Поверенный</name>
    <comment>Осуществление расчета с покупателем (клиентом) пользователем, являющимся поверенным</comment>
  </enumValues>
  <enumValues>
    <name>Комиссионер</name>
    <comment>Осуществление расчета с покупателем (клиентом) пользователем, являющимся комиссионером</comment>
  </enumValues>
  <enumValues>
    <name>Агент</name>
    <comment>Осуществление расчета с покупателем (клиентом) пользователем, являющимся агентом и не являющимся банковским платежным агентом (субагентом), платежным агентом (субагентом), поверенным, комиссионером</comment>
  </enumValues>
</mdclass:Enum>

УчетВУправляющихДляГит1/src/Enums/ПризнакиПредметаРасчета/ПризнакиПредметаРасчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПризнакиПредметаРасчета</name>
  <enumValues>
    <name>Товар</name>
    <comment>Реализуемый товар, за исключением подакцизного товара</comment>
  </enumValues>
  <enumValues>
    <name>ПодакцизныйТовар</name>
    <comment>Реализуемый подакцизный товар</comment>
  </enumValues>
  <enumValues>
    <name>Работа</name>
    <comment>Выполняемая работа</comment>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
    <comment>Оказываемая услуга</comment>
  </enumValues>
  <enumValues>
    <name>СтавкаАзартнойИгры</name>
    <comment>Прием ставок при осуществлении деятельности по проведению азартных игр</comment>
  </enumValues>
  <enumValues>
    <name>ВыигрышАзартнойИгры</name>
    <comment>Выплата денежных средств в виде выигрыша при осуществлении деятельности по проведению азартных игр</comment>
  </enumValues>
  <enumValues>
    <name>ЛотерейныйБилет</name>
    <comment>Прием денежных средств при реализации лотерейных билетов</comment>
  </enumValues>
  <enumValues>
    <name>ВыигрышЛотереи</name>
    <comment>Выплата денежных средств в виде выигрыша при осуществлении деятельности по проведению лотерей</comment>
  </enumValues>
  <enumValues>
    <name>ПредоставлениеРИД</name>
    <comment>Предоставлении прав на использование результатов интеллектуальной деятельности или средств индивидуализации</comment>
  </enumValues>
  <enumValues>
    <name>ПлатежВыплата</name>
    <comment>Аванс, задаток, предоплата, кредит, взнос в счет оплаты, пени, штраф, вознаграждение, бонус и ином аналогичном предмете расчета</comment>
  </enumValues>
  <enumValues>
    <name>АгентскоеВознаграждение</name>
    <comment>Вознаграждение пользователя, являющегося платежным агентом (субагентом), банковским платежным агентом (субагентом), комиссионером, поверенным или иным агентом</comment>
  </enumValues>
  <enumValues>
    <name>СоставнойПредметРасчета</name>
    <comment>Предмет расчета, состоящем из предметов, каждому из которых может быть присвоено другие значения перечисления</comment>
  </enumValues>
  <enumValues>
    <name>ИнойПредметРасчета</name>
    <comment>Предмет расчета,  не относящемуся к предметам расчета, которым может быть присвоено значение перечисления</comment>
  </enumValues>
  <enumValues>
    <name>ИмущественноеПраво</name>
    <comment>Передача имущественных прав</comment>
  </enumValues>
  <enumValues>
    <name>ВнереализационныйДоход</name>
    <comment>Внереализационный доход</comment>
  </enumValues>
  <enumValues>
    <name>СтраховыеВзносы</name>
    <comment>Сумма расходов, уменьшающих сумму налога (авансовых платежей) в соответствии с пунктом 3.1 статьи 346.21 Налогового кодекса РФ</comment>
  </enumValues>
  <enumValues>
    <name>ТорговыйСбор</name>
    <comment>Сумма уплаченного торгового сбора</comment>
  </enumValues>
  <enumValues>
    <name>КурортныйСбор</name>
    <comment>Курортный сбор</comment>
  </enumValues>
  <enumValues>
    <name>Залог</name>
    <comment>Залог</comment>
  </enumValues>
</mdclass:Enum>

УчетВУправляющихДляГит1/src/DataProcessors/ПечатьЧека/ManagerModule.bsl
Функция ПризнакАгентаПоПредметуРасчетаСтрокой(ПризнакАгентаПоПредметуРасчета) Экспорт
	Если НЕ ЗначениеЗаполнено(ПризнакАгентаПоПредметуРасчета) Тогда
		Возврат НСтр("ru = 'Собственные товары и услуги'");
	Иначе
		Если ПризнакАгентаПоПредметуРасчета = Перечисления.ПризнакиАгента.БанковскийПлатежныйАгент Тогда
			ПризнакАгентаСтрокой = НСтр("ru = 'банковского платежного агента'");
		ИначеЕсли ПризнакАгентаПоПредметуРасчета = Перечисления.ПризнакиАгента.БанковскийПлатежныйСубагент Тогда
			ПризнакАгентаСтрокой = НСтр("ru = 'банковского платежного субагента'");
		ИначеЕсли ПризнакАгентаПоПредметуРасчета = Перечисления.ПризнакиАгента.ПлатежныйАгент Тогда
			ПризнакАгентаСтрокой = НСтр("ru = 'платежного агента'");
		ИначеЕсли ПризнакАгентаПоПредметуРасчета = Перечисления.ПризнакиАгента.ПлатежныйСубагент Тогда
			ПризнакАгентаСтрокой = НСтр("ru = 'платежного субагента'");
		Иначе
			ПризнакАгентаСтрокой = НСтр("ru = 'комиссионера'");
		КонецЕсли;
		
		Возврат СтрШаблон(НСтр("ru = 'Выступает в качестве %1'"), ПризнакАгентаСтрокой);
	КонецЕсли;
КонецФункции
 
Функция ПризнакиСпособаПредметаРасчетаСтрокой(ПризнакАгентаПоПредметуРасчета, ПризнакСпособаРасчета, ПризнакПредметаРасчета) Экспорт
	ПризнакиСпособаПредметаРасчета = Новый Массив;
		
	ПризнакиСпособаПредметаРасчета.Добавить(ПризнакСпособаРасчета);
		
	Если ПризнакАгентаПоПредметуРасчета = Неопределено Тогда
		Если ПризнакПредметаРасчета <> Перечисления.ПризнакиПредметаРасчета.ПлатежВыплата Тогда
			ПризнакиСпособаПредметаРасчета.Добавить(ПризнакПредметаРасчета);
		КонецЕсли;
	ИНаче
		ПризнакиСпособаПредметаРасчета.Добавить(НРег(ПризнакАгентаПоПредметуРасчетаСтрокой(ПризнакАгентаПоПредметуРасчета)));
	КонецЕсли;
		
	Возврат СтрСоединить(ПризнакиСпособаПредметаРасчета, ", ");
КонецФункции
